### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_scheduled_query_rules_alert_v2.pubkeys_revoke_failure_alert_rule will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "pubkeys_revoke_failure_alert_rule" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = <<-EOT
            Permanent failures processing pubkeys-revoke-01 queue. REQUIRED MANUAL ACTION.
        EOT
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CITIZEN-AUTH | iopitnauthsessionst01] Failures on pubkeys-revoke-01-poison queue"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthsessionst01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName contains "PutMessage"
                  | where Uri contains "pubkeys-revoke-01-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # module.function_lollipop.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.io_platform_apim_api_itn.module.bpd_api_session_manager.azurerm_api_management_api_policy.this[0] will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-bpd-api-v1"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service id="apim-pool-session-manager" backend-id="session-manager-pool" />
          - 		<rewrite-uri template="@(context.Request.Url.Path)" />
          - 	</inbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          - </policies>
          + <policies>
          +       <inbound>
          +         <base />
          +       </inbound>
          +       <backend>
          +           <base />
          +       </backend>
          +       <outbound>
          +           <base />
          +       </outbound>
          +       <on-error>
          +           <base />
          +       </on-error>
          +   </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # module.io_platform_apim_api_itn.module.external_api_session_manager.azurerm_api_management_api_policy.this[0] will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-external-api-v1"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service id="apim-pool-session-manager" backend-id="session-manager-pool" />
          - 		<rewrite-uri template="@(context.Request.Url.Path)" />
          - 	</inbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          - </policies>
          + <policies>
          +       <inbound>
          +         <base />
          +       </inbound>
          +       <backend>
          +           <base />
          +       </backend>
          +       <outbound>
          +           <base />
          +       </outbound>
          +       <on-error>
          +           <base />
          +       </on-error>
          +   </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # module.io_platform_apim_api_itn.module.fims_api_session_manager.azurerm_api_management_api_policy.this[0] will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-fims-api-v1"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service id="apim-pool-session-manager" backend-id="session-manager-pool" />
          - 		<rewrite-uri template="@(context.Request.Url.Path)" />
          - 	</inbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          - </policies>
          + <policies>
          +       <inbound>
          +         <base />
          +       </inbound>
          +       <backend>
          +           <base />
          +       </backend>
          +       <outbound>
          +           <base />
          +       </outbound>
          +       <on-error>
          +           <base />
          +       </on-error>
          +   </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # module.io_platform_apim_api_itn.module.pagopa_api_session_manager.azurerm_api_management_api_policy.this[0] will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-session-manager-pagopa-api-v1"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service id="apim-pool-session-manager" backend-id="session-manager-pool" />
          - 		<rewrite-uri template="@(context.Request.Url.Path)" />
          - 	</inbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          - </policies>
          + <policies>
          +       <inbound>
          +         <base />
          +       </inbound>
          +       <backend>
          +           <base />
          +       </backend>
          +       <outbound>
          +           <base />
          +       </outbound>
          +       <on-error>
          +           <base />
          +       </on-error>
          +   </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```

</details>
